examples/single_turbine/Gauss/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2206                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Disk 1
disk1
{
    type            actuatorDiskFoam;
    variant         Gauss;
    selectionMode   cellSet;
    cellSet         actuationDisk1;
    diskDir         (1 0 0);
    Ct              0.7500;
    diskArea        5026.5;
    // For the constant variant, you need to specify a reference velocity,
    // which should be equal to the hub height value of the inflow velocity.
    Uref_fixed       8.0;
// turbine position of centre to help with kernel calc
    centrex          0;
    centrey          0;
    centrez          $zh;
// dimensions of the turbine fed into kernel (ideally thickness should be 2-4 cells)
    Diameter         80;
    Thickness        #eval "4*$dx"; 
}

